const levels = [
  {
    title: "المرحلة 1",
    id: "level0",
    description: `يُعتبر المستوى 0 أو المستوى التمهيدي مدخلًا لعالم البرمجة، موجهًا لتلاميذ المدارس والأشخاص غير المعتادين على البرمجة. ونظرًا لكون أغلب المصطلحات جديدة على التلاميذ، فإننا نركز في البداية على تقديم تعريف شامل أو لمحة عامة عن الحاسوب وأنظمة التشغيل والبرمجة كمعلومات إثرائية للطفل.

لاحقًا، يتم تفصيل بعض المصطلحات مثل الخوارزميات والبرمجة، ثم نتطرق إلى أساسيات البرمجة ومختلف الأوامر، مع توظيفها في أمثلة عملية على شكل ألعاب، قصص، ورسوم متحركة، مما يسهل على التلميذ الاستيعاب ويجعله مهتمًا وشغوفًا بالتعلم أكثر.

في نهاية الدورة، ينجز التلاميذ مشروعًا شاملًا لكل ما تعلموه، والذي يُعدّ بمثابة تقييم لهم. كما يحصلون في ختام الدورة على فرصة للتعرف على الأردوينو وعالم الروبوتيك.`,
  },
  {
    title: "المرحلة 2",
    id: "level1",
    description: `بعد إكمال الأطفال للمستوى 0 أو المستوى التمهيدي، تتكون لديهم فكرة عامة عن البرمجة والتي تمكنهم من إنشاء مشاريع مختلفة مع بعض النقائص طبعًا.

في المستوى 1 من هذه الدورة، نركز على البرمجة أكثر من السابق، فقد صار التلاميذ معتادين على مختلف المصطلحات وواجهة سكراتش والعديد من الأمور الجديدة عليهم.

مع الكثير من التطبيقات على ما سبق تعلمه في الدورة السابقة، يتعرف التلاميذ في هذه الدورة على أمور جديدة في البرمجة وتقنيات أكثر تعقيدًا، لكنها يمكن أن تبسط مشاريعهم لاحقًا وتجعلها أكثر إتقانًا، مما يفتح لهم أبوابًا لبرمجة مشاريع أكبر.`,
  },
  {
    title: "المرحلة 3",
    id: "level2",
    description: `في هذا المستوى، يتعرف التلاميذ على لوحة الأردوينو وبعض الأساسيات المهمة في الإلكترونيك، ثم يتم دمجها مع البرمجة بواسطة لغة سكراتش التي تدعم هذه اللوحة.

نركز في هذا المستوى على جانب الإلكترونيك من خلال دراسة مختلف الأساسيات وطريقة التعامل مع مختلف المكونات الكهربائية، وتجسيد بعض المشاريع الصغيرة في البداية لترسيخ المعارف المكتسبة. ثم تختتم الدورة بتجسيد التلاميذ لمشروع متكامل بأنفسهم.`,
  },
  {
    title: "المرحلة 4",
    id: "level3",
    description: `التلاميذ الآن معتادون على البرمجة وأساسياتها، وكذلك لغة سكراتش، كما يملكون رصيدًا لا بأس به من المعلومات حول الأردوينو والإلكترونيك. في هذا المستوى، نواصل تعزيز قدراتهم على التعامل مع مختلف المكونات الكهربائية وتجسيد مشاريع أكثر تعقيدًا.

بالإضافة إلى لغة سكراتش، يستخدم التلاميذ بيئة تطوير الأردوينو التي تعتمد على لغة برمجة شبيهة بلغة C++، وهي لغة بسيطة نوعًا ما. يتم تجسيد كل الأمثلة باللغتين، ليتمكن التلميذ من ملاحظة أن الأساسيات تبقى نفسها في كل اللغات، مع اختلاف طريقة كتابة التعليمات فقط.

في نهاية الدورة، يتمكن التلاميذ من إنشاء مشاريع بالأردوينو وبرمجتها باستخدام سكراتش وبيئة تطوير الأردوينو.`,
  },
  {
    title: "المرحلة 5",
    id: "level4",
    description: `في هذا المستوى، يتعرف التلاميذ على لوحة الأردوينو وبعض الأساسيات المهمة في الإلكترونيك، ثم يتم دمجها مع البرمجة بواسطة لغة سكراتش التي تدعم هذه اللوحة.

نركز في هذا المستوى على جانب الإلكترونيك من خلال دراسة مختلف الأساسيات وطريقة التعامل مع مختلف المكونات الكهربائية، وتجسيد بعض المشاريع الصغيرة في البداية لترسيخ المعارف المكتسبة. ثم تختتم الدورة بتجسيد التلاميذ لمشروع متكامل بأنفسهم.`,
  },
];

export default levels;
